# CanUseDepthCueing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CanUseDepthCueing Method
View Class See Also
---
Indicates if view can use Depth Cueing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool CanUseDepthCueing()
```

Visual Basic
---
```text
Public Function CanUseDepthCueing As Boolean
```

Visual C++
---
```text
public:
bool CanUseDepthCueing()
```

# ### Return Value
True if view can use Depth Cueing
# See Also
View Class
Autodesk.Revit.DB Namespace